Repository: khabbazan/FoodRecipeHub
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fa

source: Invalid Credentials.
fa: اطلاعات ورود نامعتبر.

source: Token Expired.
fa: توکن منقضی شده است.

source: Invalid refresh token
fa: توکن تازه‌سازی نامعتبر است

source: Could not validate timestamps
fa: نمی‌توان مهلت‌ها را تایید کرد

source: Not authenticated
fa: تأیید نشده

source: user '{user}' login successfully
fa: کاربر '{user}' با موفقیت وارد شد

source: user '{user}' login failed
fa: ورود کاربر '{user}' ناموفق بود

source: user '{user}' update successfully
fa: کاربر '{user}' با موفقیت به‌روز شد

source: user '{user}' update failed
fa: به‌روزرسانی کاربر '{user}' ناموفق بود

source: user '{user}' logout successfully
fa: کاربر '{user}' با موفقیت خارج شد

source: user '{user}' logout failed
fa: خروج کاربر '{user}' ناموفق بود

source: refresh token for user '{user}' update successfully
fa: توکن تازه‌سازی برای کاربر '{user}' با موفقیت به‌روز شد

source: refresh token for user '{user}' update failed
fa: به‌روزرسانی توکن تازه‌سازی برای کاربر '{user}' ناموفق بود

source: recipe '{title}' for '{user}' create successfully
fa: دستور '{title}' برای کاربر '{user}' با موفقیت ایجاد شد

source: recipe '{title}' for '{user}' create failed
fa: ایجاد دستور '{title}' برای کاربر '{user}' ناموفق بود

source: recipe '{uuid}' updated by {user} successfully
fa: دستور '{uuid}' توسط {user} با موفقیت به‌روز شد

source: recipe '{uuid}' was not successfully updated by {user}
fa: به‌روزرسانی دستور '{uuid}' توسط {user} با موفقیت انجام نشد

source: recipe '{uuid}' deleted by {user} successfully
fa: دستور '{uuid}' توسط {user} با موفقیت حذف شد

source: recipe '{uuid}' was not successfully deleted by {user}
fa: حذف دستور '{uuid}' توسط {user} با موفقیت انجام نشد

source: user '{user}' follows '{following}' successfully
fa: کاربر '{user}' با موفقیت '{following}' را دنبال می‌کند

source: user '{user}' failed to follow '{following}'
fa: کاربر '{user}' ناتوان در دنبال کردن '{following}' شد

source: user '{user}' unfollow '{following}' successfully
fa: کاربر '{user}' با موفقیت دنبال کردن '{following}' را لغو کرد

source: user '{user}' failed to unfollow '{following}'
fa: کاربر '{user}' ناتوان در لغو دنبال کردن '{following}' شد

source: Failed to upload image {} to bucket {}
fa: بارگذاری تصویر {} به سبد {} ناموفق بود

source: Extension is invalid
fa: پسوند نامعتبر است

source: Image name is not valid. there is no file extension.
fa: نام تصویر معتبر نیست. پسوند فایل وجود ندارد.

source: Base64 content is not valid
fa: محتوای Base64 معتبر نیست

source: The requested recipe does not belong to the authenticated user
fa: دستور درخواستی به کاربر تأیید شده تعلق ندارد

source: Recipe title must contain at least 8 characters
fa: عنوان دستور باید حداقل 8 کاراکتر داشته باشد

source: Recipe content must contain at least 50 characters
fa: محتوای دستور باید حداقل 50 کاراکتر داشته باشد

source: The requested following not find
fa: شخص مورد نظر پیدا نشد

source: Invalid phone number
fa: شماره تلفن نامعتبر است

source: Password must contain at least 8 characters
fa: رمز عبور باید حداقل 8 کاراکتر داشته باشد

source: Password must contain at least one lowercase character
fa: رمز عبور باید حداقل یک حروف کوچک داشته باشد

source: Password must contain at least one uppercase character
fa: رمز عبور باید حداقل یک حروف بزرگ داشته باشد

source: Password must contain at least one digit character
fa: رمز عبور باید حداقل یک عدد داشته باشد

source: Invalid email address
fa: آدرس ایمیل نامعتبر است

source: Bad Request
fa: درخواست نامعتبر

source: Invalid Credentials
fa: اطلاعات ورود نامعتبر

source: new
fa: جدید

source: trend
fa: مد

source: professional
fa: حرفه‌ای

source: male
fa: مرد

source: female
fa: زن

source: welcome to FoodRecipeHub!!!
fa: به فود هاب خوش آمدید!!!
